{"class_name": "Model", "config": {"name": "model_13", "layers": [{"name": "input_13", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 60], "dtype": "float32", "sparse": false, "name": "input_13"}, "inbound_nodes": []}, {"name": "embedding_13", "class_name": "Embedding", "config": {"name": "embedding_13", "trainable": true, "batch_input_shape": [null, 60], "dtype": "float32", "input_dim": 50001, "output_dim": 60, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 60}, "inbound_nodes": [[["input_13", 0, 0, {}]]]}, {"name": "dropout_13", "class_name": "Dropout", "config": {"name": "dropout_13", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["embedding_13", 0, 0, {}]]]}, {"name": "bidirectional_13", "class_name": "Bidirectional", "config": {"name": "bidirectional_13", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_13", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 32, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.1, "implementation": 2}}, "merge_mode": "concat"}, "inbound_nodes": [[["dropout_13", 0, 0, {}]]]}, {"name": "time_distributed_13", "class_name": "TimeDistributed", "config": {"name": "time_distributed_13", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense_13", "trainable": true, "dtype": "float32", "units": 5, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["bidirectional_13", 0, 0, {}]]]}], "input_layers": [["input_13", 0, 0]], "output_layers": [["time_distributed_13", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}